Tekla Open API Reference for Tekla Structures 2025
Rotation3D.AxisX Property
Gets the X direction.
 Namespace: Tekla.Structures.Model.Geometry
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector AxisX { get; }
Public ReadOnly Property AxisX As Vector
	Get
Property Value
Type: Vector
See Also
Reference
Rotation3D Class
Tekla.Structures.Model.Geometry Namespace